import styles from "./styles.module.css";
import close from "../../Images/close.png";

interface Props {
    show: boolean
    setshow: any
}

export default function HelpModal({ show , setshow}: Props): JSX.Element {
    return (
        <div className={show?styles.div_container:styles.div_modal_hide}>
            <div className={styles.div_box}>

                <div className={styles.close_button} >
                    <button className={styles.close} onClick={()=>setshow(false)}>بستن راهنما
                        <img src={close} className={styles.image_close}/>
                    </button>
                </div>

                <div className={styles.div_spans} >
                <div className={styles.div_spans_inner} >

                <span className={styles.text_helpFirst}>
- &nbsp;با مطالعه دو پاراگراف، سوالی را طراحی کنید که برای پاسخ به آن نیاز به بررسی هر دو پاراگراف باشد . توجه کنید که پاسخ سوال باید داخل متن موجود بوده و نیازی نباشد که کلمه یا کلماتی جدید تولید شود. مگر اینکه سوال به صورت مقایسه ای بوده و پاسخ آن بصورت بله/خیر یا بیشتر/کمتر و نکاتی از این قبیل باشد. (مانند: آیا امام سوم شیعیان برادر امام حسن (ع) است؟ بله)<br/>
                      - &nbsp;چنانچه متن دو پاراگراف به هردلیلی قابلیت طراحی سوال را نداشت، می توانید با زدن دکمه "تولید نمونه جدید"، به سراغ یک زوج پاراگراف جدید بروید.<br/>
                    - &nbsp;سوال و جواب را به شکل یک رشته وارد کنید.<br/>
- &nbsp;شماره جملاتی که در پیدا کردن جواب مورد نیاز است را به شکل زیر وارد کنید:(اعداد انگلیسی) 1,2,5<br/><br/>
                </span>


                <span className={styles.text_helpFirst}>
نمونه مثال:
                </span>



                <span className={styles.text_helpSecond}>
پارگراف اول:<br/>
                    [1]پیامدهای غیبت به دو بخش دنیوی و اخروی تقسیم شده است. [2]ایجاد بی‌اعتمادی نسبت به غیبت کننده و ایجاد کینه و دشمنی در جامعه، برخی از پیامدهای دنیوی غیبت است. [3]یکی از پیامدهای اخروی غیبت، از میان رفتن حسنات و نیکی‌ها است. [4]بر اساس روایات، نخستین کسی که به دوزخ می‌رود شخص غیبت کننده است.<br/><br/>
                    پاراگراف دوم:<br/>
                    [1]کینه یکی از رذائل اخلاقی و حالتی روحی است که فرد در آن حالت، دشمنیِ دیگری را در دل پنهان کرده و منتظر فرصت مناسب است تا آن را ابراز کند. [2]کینه را از آثار خشم دانسته‌اند. [3]جدال لفظی، سرزنش، غیبت، تمسخر، نفرین و فحاشی از عواملی هستند که ممکن است باعث شوند طرف مقابل، کینه فرد را به دل بگیرد. [4]کینه موجب گناهان ديگري مانند حسادت، غیبت، تهمت، سرزنش، توبيخ و تحقیر دیگران نیز می‌شود.<br/><br/>

                </span>

                <span className={styles.text_helpFirst}>
طرح سوال:<br/>

                </span>


                <span className={styles.text_helpSecond}>
هر نوع رویکردی در طراحی سوال را می توانید داشته باشید و مشکلی ندارد. به عنوان نمونه:<br/><br/>

                </span>


                    <span className={styles.text_helpFirst}>
*) سوال شما می تواند در مورد ویژگی مربوط به آن کلمه مشترک باشد. مثال:<br/>

                </span>



                    <span className={styles.text_helpSecond}>
سوال پیشنهادی: کدام پیامد دنیوی غیبت است که فرد در آن حالت، دشمنیِ دیگری را در دل پنهان کرده است؟<br/><br/>
                        پاسخ پیشنهادی: کینه<br/><br/>
                        جملات راهنمای پاراگراف اول: 1,2<br/><br/>
                        جملات راهنمای پارگراف دوم: 1,2<br/><br/>
                        مشاهده می کنید که ابتدا باید با بررسی جمله 1و2 پاراگراف اول متوجه شویم که غیبت پیامد های دنیوی و اخروی دارد و پیامد های دنیوی آن چیست که یکی از آنها "کینه" است. حال با بررسی جمله 1و2 پاراگراف دوم متوجه می شویم که "کینه" همان پیامد دنیوی است که ویژگی مورد نظر سوال را دارا است. در نتیجه به پاسخ سوال دست یافته ایم. همانطور که مشاهده می کنید، مستقیما از "کینه" به عنوان کلمه مشترک دو پاراگراف سوال شده است.<br/><br/>
                </span>



                    <span className={styles.text_helpFirst}>
*) سوال شما می تواند در مورد ویژگی مربوط به آن کلمه مشترک باشد. مثال:<br/>

                </span>


                    <span className={styles.text_helpSecond}>
سوال پیشنهادی: پیامد دنیوی غیبت که فرد در آن حالت، دشمنیِ دیگری را در دل پنهان کرده است از آثار چیست؟<br/><br/>
                        پاسخ پیشنهادی: خشم<br/><br/>
                        جملات راهنمای پاراگراف اول: 1,2<br/><br/>
                        جملات راهنمای پاراگراف دوم: 1,2,3<br/><br/>
                        در اینجا نیز مشاهده می کنید که ابتدا باید با بررسی جمله 1و2 پاراگراف اول متوجه شویم که غیبت پیامد های دنیوی و اخروی دارد و پیامد های دنیوی آن چیست که یکی از آنها "کینه" است. حال با بررسی جمله 1و2 پاراگراف دوم متوجه می شویم که "کینه" همان پیامد دنیوی است که ویژگی مورد نظر سوال را دارا است. در نهایت با بررسی جمله 3 متوجه می شویم که کینه از آثار "خشم" است. در نتیجه به پاسخ سوال دست یافته ایم. همانطور که مشاهده می کنید، از "خشم" به عنوان یک ویژگی مربوط به "کینه" به عنوان کلمه مشترک دو پاراگراف سوال شده است.<br/><br/>

                </span>

                    <span className={styles.text_helpFirst}>
*) سوال شما می تواند بصورت مقایسه ای بین دو پاراگراف باشد.<br/>
                    </span>

                    <span className={styles.text_helpSecond}>
                        سوال پیشنهادی: آیا غیبت و کینه هرکدام موجب ایجاد یکدیگر هستند؟<br/>
پاسخ پیشنهادی: بله<br/><br/>
                        جملات راهنمای پاراگراف اول: 2<br/><br/>
                        جملات راهنمای پاراگراف دوم: 4<br/><br/>
در اینجا بصورت مقایسه ای عمل کرده ایم. شما با بررسی جمله 2 پاراگراف اول و جمله 4 پاراگراف دوم متوجه می شوید هم غیبت موجب ایجاد کینه است و هم کینه موجب غیبت می شود. بنابراین هرکدام موجب ایجاد دیگری است و پاسخ یافت می شود. همانطور که مشاهده می شود، در برخی متون می توان سوال مقایسه ای نیز مطرح کرد.<br/><br/>
                </span>


                    <span className={styles.text_helpFirst}>
*) چند نوع نمونه سوال پیشنهادی دیگر:<br/>
                </span>





                    <span className={styles.text_helpSecond}>
سوال پیشنهادی: چندمین فرزند امام اول شیعیان در کربلا به شهادت رسیده است؟ (پاراگراف اول: در مورد حضرت علی(ع) / پاراگراف دوم: در مورد امام حسین(ع))<br/><br/>
سوال پیشنهادی: پسر بزرگ فرزند امام اول شیعیان که در کربلا به شهادت رسیده است، چه نام دارد؟ (پاراگراف اول: در مورد حضرت علی(ع) / پاراگراف دوم: در مورد امام حسین(ع))<br/><br/>
                        سوال پیشنهادی: امام حسن از امام حسین بزرگتر بوده است یا کوچکتر؟ (پاراگراف اول: در مورد امام حسن(ع) / پاراگراف دوم: در مورد امام حسین(ع))<br/><br/>

                        سوال پیشنهادی: فرزندان امام اول شیعیان به غیر از امام حسن و امام حسین چه کسانی هستند؟ (پاراگراف اول: در مورد حضرت علی(ع) / پاراگراف دوم: در مورد فرزندان حضرت علی(ع))<br/><br/>

                </span>



                    <span className={styles.text_helpFirst}>
*) و به طور کلی، در طراحی سوال می توانید از هر اطلاعاتی که برای رسیدن به آن نیاز باشد هر دو پاراگراف بررسی شده و سپس پاسخ یافته شود، استفاده کنید. که معمولا چنین سوالاتی از نوع چندمرحله‌ای هستند.<br/>
                </span>

                </div>
                </div>
        </div>



        </div>
    );

}
